{
    "sections": [
      {
        "title": "Hush",
        "lyrics": "Mud under dust, floats through the sand\nAll that it was, all but again I’m back to\nLight and the rush, dark and the hush\nAll of it and, all but again I’m back to..\n\nYou're mine, turn the light off, (this) isn’t another write off\nTryna make it all official with a payment on a down or something like that\nCan I get you to come around and stay for a chat?\nI got a bed, and you got a body\nScented candles kinda smells like mahogany all on me\nAphrodisiac I wanted you wanting me, uh\nChocolates Cherries honey coffee\nSip slow on a french press sticky my lips all glossy\nGoofy ass head tilted down to one side\nBody up in my bed I follow you w my eyes\nFace kissin on me from my waist to my thighs\nWasted on good vibes we chasin em all night\n\nMud under dust, floats through the sand\nAll that it was, all but again I’m back to\nLight and the rush, dark and the hush\nAll of it and, all but again I’m back to...\n\nFor the first time in a while\nI had a dream about a gentile\nHis body drifted slowly from the center of his chest.. how\nDid he have so much to give though touch and “yes”s\nWith a hole the size of Everest in his heart?\nHis mind was seven worlds apart from his desires\nAnd still he knew all the nothings I required.\nFrom the roses that he held behind his back for my surprise,\nTo the way he told his lies.\nIn my dream I saw the darkness for the first time.\nIt should have been a gold mine\nBut I couldn’t help but put him back together.\nI tried to grab his arms and feet and push them to the center,\nBut I couldn’t reach\nThe hole above his heart was holding on to me.\nSo I peered into his darkness for the first time.\nHead first, I fell in"
      },
      {
        "title": "meaning",
        "content": "Chorus:\nThese lyrics capture the feeling of getting caught in the small, fleeting moments of life—so much so that the bigger picture fades into the background. “Mud under dust that floats through the sand” symbolizes cycles of rebirth and the inevitability of things coming full circle, much like the idea that “what goes around comes around.” The recurring phrase “but again I’m back to…” reflects the feeling of being stuck in the rhythm of daily life, lost in the passing of time without a clear awareness of the larger journey. It’s like waves washing over memories\n\nVerses:\nVerse 1 is something I wrote to my most recent boyfriend and it kind of encapsulates the feelings that I had for him during our relationship with him. It was very silly and goofy and full of a lot of love and fun intimacy. It was the first time in a while that I felt true organic love for someone and ultimately, I told him I was in love with him and he told me he wasn’t over his ex, and that really broke my heart. So the current hole in my heart was placed by him\n\nThe second verse is a poem I wrote after a very vivid dream I had about the first person I fell in love with when I was 15. He cheated on me and totally totally broke my heart in highschool and it took me a very long time to get over him. He had a really fucked up childhood and was clearly dealing with his own issues, but I could not see them at the time. The dream that I had that i wrote about was me literally being able to see this huge hole in his heart, and trying to put him back together because the love and the feelings that I developed for him kind of overpowered this knowledge that he wasn’t capable of giving that back to me. And then in the dream I end up looking inside and I remember it looked like this gross cavity of goo and like a bad sewer.\n\nOverall, the song is kind of just a deep reflection of when I’ve felt love the strongest in the romantic relationships I’ve had so far and going back to the chorus, how I can get so caught up in these moments, but the bigger picture is and will always be there."
      },
      {
        "title": "SANTAL 33",
        "lyrics": "Night time mind and I might just bite\nBurning Santal fire, don’t it feel so nice?\nNight time mind baby, can’t we lie\nLeave the world behind, fall in love were fall in love run-in) x2\n\nSomething in the room, do you feel it?\nSmell of scented candle with a plume to the ceiling \nSmoke intoxicating your brain concentrating no fade\nYou owe me a moon yeah I’m dealing, dealing with my own shit\nI hit you when I’m down. Down for what? I need love\nI need good hard heavy hands up\nGrab my wrist, Give a fuck! \nMake it worth driving over to the west side\nBetter pur when i'm showin you my best side\nFind the words tryna keep me for the next night\nDo you want me for the next night?\nYou better want me in the deep end\nPerfume, just a bit to get your feet wet \nBaby you know you got just what I need right?\nDo you want me for the next night?\n\nNight time mind and I might just bite\nBurning Santal fire, don’t it feel so nice?\nNight time mind baby, can’t we lie\nLeave the world behind, fall in love were fall in love run-in) x2\n\nSomething in the room, do you feel it?\nI been all predictable and you been on the ceiling \nNight on my mind no paradigm, I just wanna ride, \nImma call you mine only for a feeling\nFeelin then im moaning\nI hit you cause I'm down\nDown for what? You know what\nYou know I want it feeling like love\nHold me back baby I've been locked up\nI can play my part when I'm lonely \nDon't go heavy hearted in the morning, Pull apart but I hit you with a warning\nAnd you call me baby when you’re lonely\nDon't go heavy hearted when im only \nHere for goose down And maybe a good time\nYou're over it"
    },
    {
        "title": "meaning",
        "content": "This song is about a fun, passionate one-night stand. Santal, one of my favorite perfumes, serves as a metaphor for desire, something intoxicating and fleeting. It captures the thrill of it and fully embraces passion without worrying about emotional outcomes.\nBoth verses are about an ideal one night stand, where we both know what we like in bed but don’t want to date. To keep things light and avoid emotional entanglement, we see each other once every three months (unfortunately this dude actually exists in my life right now). The lyrics describe our dynamic, how I want to feel about him, and how I want him to feel about me. Beneath the playfulness, there’s an awareness that feelings could complicate things so I keep our relationship sparse and light to maintain the balance.\nVerse 2 explores the way I use the physical and verbal love languages to lure him in, but only for the night. Coming after Hush, Santal reflects how my love language has shifted after experiencing heartbreak. There’s a part of me that’s become a “player” as a defense mechanism. This song captures how that mindset plays out in my love life and sex life."
      },
      {
        "title": "ATTITUDE",
        "lyrics": "I know you’re dangerous, I’m so divided\nYou get upset and it gets me excited\nIt's all the same for us, I know you like it\nWe get addicted to all of the fighting\n\nAnd I know I can’t take all the pain\nBut it hurts so good I don’t complain\n\nI’ll admit, I’ll start a fight or two\nI like attention and spending the night with you\nI throw a fit\nYou bring an attitude \nI want you leaving but I’m coming back for you\n\nAnd I know I can’t take all the pain\nBut it hurts so good I don’t complain\n\nI might come through tonight\nI might come through tonight"
    },
    {
        "title": "meaning",
        "content": "Despite being intense and unhealthy, the push-pull dynamic of the lovers in Attitude has shaped lots of my romantic desires. “I know I can’t take all the pain, but it hurts so good I don’t complain” captures the passion woven through discomfort that keeps pulling me back into toxic relationships environments. I want someone to care so much that they’d rather leave than love me in a way that feels passive or temporary.\nAfter lyrically overanalyzing the lovers dynamic in the first half of the song, “I might come through tonight” is the breakthrough. Instead of overthinking, I just let myself exist in the moment. It’s no longer about defining what this relationship is but now about choosing to experience it regardless of the flaws. I’m no longer explaining myself to the listener."
      },
      {
        "title": "MOTHER MEDICINE",
        "lyrics": "Mother medicine \nSupplement it in\nI feel better when there’s less I need to know\nWhen the path is parted by the melted snow\nWarmer weather take me home\nI forgot again\nIs the kearning of your cadence something I should make of note?\nIt gets softer as its going down your throat\nTake a little take me home\n\nMountain/Fountain water\nFalling through the hills until the river follows\nWhy it always will but how \nThe undercurrent suddenly went still I'll never know\n\nMother medicine \nI am new again\nI found heaven on the river like I hoped\nIt was pooling up in puddles in my boat\nTook a little take me home\nI was everything\nI was fire in the desert and the leather on your coat\nI went higher than I ever knew to go \nPull me in and take me home\n\nMountain/Fountain water\nFalling through the hills until the river follows\nWhy it always will but how \nThe undercurrent suddenly went still I'll never know"
    },
    {
        "title": "meaning",
        "content": "As you may have noticed from the previous songs on Mother, I have a tendency to overthink things. As I tirelessly spiral around my relationships with myself and others, Mother Medicine gently enters the project as a reminder that the something greater than me, (Mother Nature, the collective consciousness, God?) will guide my fluttered thoughts back down to earth.\n“I feel better when there’s less I need to know\nWhen the path is parted by the melted snow,\nWarmer weather take me home” \nThe transition from the end of Attitude to Mother Medicine flips my mental switch from anxious passivity to a commitment of honesty and change. I surrender to Mother, and let go of a frozen mind, and accept my existence.\nThis song is an honest explanation of my relationship with spirituality. On my journey to let go of the distractions to quiet my anxiety, I take Mother’s Medicine to ground myself and reconnect with nature as a source of healing.\nFrom my heart to yours."
      },
      {
        "title": "LUCKY STAR",
        "lyrics": "(breakaway, breakaway)\nI’m your lucky star\nI’m the sky when it gets dark\nLaaa, Laaa\nWater on my hands\nWash it off I’m new again, (new again)\nOnly if you could hold it\nLet me take you for a ride\nI got sunshine on my mind\nI've been getting very high\nI’ve been feeling too alive\nI could see the way it ends\nPilot falls, river bends, \nI could see, you alone\n\nSaid you wanna ride hold the door\nYeah you know it man\nRun up at your side i'm your whore\nOh I let you in \nHold you down the 5\nIt's another blurry night \nPainted sky for you someone had to die for you\nI would take your life just to know you’d never leave me \nGod who know loving you is this easy \nPeace of your heart still in my car\nThe leather never cleaning it off\nUntil I depart i'm keeping you in–"
    },
    {
        "title": "meaning",
        "content": "This song explores the duality between the divine and the mortal—the infinite and the human. After ingesting Mother’s Medicine, I feel an intense connection to the universe, dissolving into the unified field of consciousness, a concept adjacent to non-dualism. In Lucky Star, I become both the observer and the observed, speaking to myself through the voice of everything around me.\nLines like “I’m your lucky star, I’m the sky when it gets dark” reflect an ethereal presence—a higher consciousness that exists beyond time and space. At “I got sunshine on my mind, I’ve been getting very high, I’ve been feeling too alive”, this divine entity begins to slip, drawing too close to human thoughts and emotions. It starts thinking rather than simply being, causing a shift—the river bends, the pilot falls. The balance tips, and the human perspective returns.\nAs the song transitions into the slowed, rap-driven outro, the divine voice is overtaken by its counterforce—the devil, the raw, greedy, visceral energy of mortality. Lines like “I would take your life just to know you’d never leave me” and “God, who knew loving you is this easy” reflect obsession, possessiveness, and the all-consuming nature of earthly love and desire. It’s violent, messy, and flawed—yet undeniably human.\nUltimately, Lucky Star represents the yin and yang of existence. It reminds me that while it’s beautiful to feel spiritually connected, I still have a human life to live. There’s work to do, love to experience, and lessons to learn here on Earth. This song grounds me, pulling me back down to the reality of my own journey, and ultimately finishing out the project."
      }
    ]
  }
  